## Pandas

* Pandas is used to analyse data & big data and make conclusion based on 
  statistical theories.
  
* Pandas is typically used to clean messy data & make them readable & simple to
  access.
  
* It cal also help us in finding relationship between columns (co-relation)

* It can also be used in doing all statistical methodologies as well as plotting 
  and creating graphs.

In [1]:
# pip install pandas

In [2]:
import pandas as pd

In [3]:
pd.__version__

'1.4.2'

### Series

* A series is a 1-Dimensional array like object, containing a sequence of values
  (of similar data types) and an associated array of data labels called as indexes.

In [6]:
obj = pd.Series([10,20,30,40])

In [7]:
obj

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
import numpy as np

arr = np.array([10,20,30,40])

In [5]:
arr

array([10, 20, 30, 40])

In [13]:
# defining your own keys

obj2 = pd.Series([10,20,30,40],index=['d','b','a','c'])

In [14]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [15]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [16]:
obj

0    10
1    20
2    30
3    40
dtype: int64

In [17]:
obj[2]

30

In [18]:
obj[3]

40

In [19]:
obj[3] = 100

In [20]:
obj

0     10
1     20
2     30
3    100
dtype: int64

In [31]:
obj[0:3] = 4332

In [32]:
obj

0    4332
1    4332
2    4332
3     100
dtype: int64

In [33]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [34]:
obj2['a']

30

In [35]:
obj2[2]

30

In [36]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [37]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [38]:
obj

0    4332
1    4332
2    4332
3     100
dtype: int64

In [39]:
obj

0    4332
1    4332
2    4332
3     100
dtype: int64

In [40]:
obj[[0,2,3]]

0    4332
2    4332
3     100
dtype: int64

In [41]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [43]:
obj2[['d','c']]

d    10
c    40
dtype: int64

In [44]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [45]:
obj2 > 20

d    False
b    False
a     True
c     True
dtype: bool

In [47]:
res = obj2[obj2 > 20]

In [48]:
res

a    30
c    40
dtype: int64

In [49]:
type(res)

pandas.core.series.Series

In [50]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [51]:
obj2+5

d    15
b    25
a    35
c    45
dtype: int64

In [53]:
obj2

d    10
b    20
a    30
c    40
dtype: int64

In [54]:
obj2 - 2

d     8
b    18
a    28
c    38
dtype: int64

In [55]:
obj2 * 2

d    20
b    40
a    60
c    80
dtype: int64

In [56]:
obj2 / 2

d     5.0
b    10.0
a    15.0
c    20.0
dtype: float64

## creating series from python dictionary

In [57]:
data = {
    'Mumbai':1000,
    'Delhi':7500,
    'Nagpur':5000,
    'Chennai':3212
}

In [58]:
data

{'Mumbai': 1000, 'Delhi': 7500, 'Nagpur': 5000, 'Chennai': 3212}

In [59]:
obj4 = pd.Series(data)

In [60]:
obj4

Mumbai     1000
Delhi      7500
Nagpur     5000
Chennai    3212
dtype: int64

In [61]:
data_2 = {
    'city':['Mumbai','Pune','Chennai'],
    'salary':[3500,4500,6000]
}

In [62]:
data_2

{'city': ['Mumbai', 'Pune', 'Chennai'], 'salary': [3500, 4500, 6000]}

In [63]:
obj5 = pd.Series(data_2)

In [64]:
obj5

city      [Mumbai, Pune, Chennai]
salary         [3500, 4500, 6000]
dtype: object

In [66]:
type(obj5['city'])

list

In [67]:
type(obj5)

pandas.core.series.Series

In [68]:
obj4

Mumbai     1000
Delhi      7500
Nagpur     5000
Chennai    3212
dtype: int64

In [75]:
data

{'Mumbai': 1000, 'Delhi': 7500, 'Nagpur': 5000, 'Chennai': 3212}

In [69]:
cities = ['Mumbai','Delhi','Nagpur','Chennai','Ahmedabad']

In [70]:
obj5 = pd.Series(data,index=cities)

In [71]:
obj5

Mumbai       1000.0
Delhi        7500.0
Nagpur       5000.0
Chennai      3212.0
Ahmedabad       NaN
dtype: float64

In [72]:
pd.isnull(obj5)

Mumbai       False
Delhi        False
Nagpur       False
Chennai      False
Ahmedabad     True
dtype: bool

In [73]:
pd.notnull(obj5)

Mumbai        True
Delhi         True
Nagpur        True
Chennai       True
Ahmedabad    False
dtype: bool

In [74]:
obj5[pd.notnull(obj5)]

Mumbai     1000.0
Delhi      7500.0
Nagpur     5000.0
Chennai    3212.0
dtype: float64

In [76]:
obj4

Mumbai     1000
Delhi      7500
Nagpur     5000
Chennai    3212
dtype: int64

In [77]:
obj5

Mumbai       1000.0
Delhi        7500.0
Nagpur       5000.0
Chennai      3212.0
Ahmedabad       NaN
dtype: float64

In [78]:
obj4+obj5

Ahmedabad        NaN
Chennai       6424.0
Delhi        15000.0
Mumbai        2000.0
Nagpur       10000.0
dtype: float64

In [79]:
ser1 = pd.Series(20,index=['chennai'])

In [81]:
ser2 = pd.Series(40,index=['Chennai'])

In [82]:
ser1

chennai    20
dtype: int64

In [83]:
ser2

Chennai    40
dtype: int64

In [84]:
ser1+ser2

Chennai   NaN
chennai   NaN
dtype: float64

### DataFrames

* A dataframe represents a rectangular table of data & contains 
  ordered collection of columns which can be of a different data type


* The DataFrame has both row & column index, it can be thought
  as a dictionary of series, all sharing the same index.
  
  
  
* The data is stored as one or more 2-D block.

<img src="https://media.geeksforgeeks.org/wp-content/uploads/finallpandas.png" width=300px; height=300px;>

In [85]:
data_1 = {
    'State':['Mumbai','Pune','Chennai','Delhi','Nagpur'],
    'year':[2001,2011,2018,2019,2020],
    'pop':[1.5,1.7,3.6,2.4,3.2]
}

In [86]:
data_1

{'State': ['Mumbai', 'Pune', 'Chennai', 'Delhi', 'Nagpur'],
 'year': [2001, 2011, 2018, 2019, 2020],
 'pop': [1.5, 1.7, 3.6, 2.4, 3.2]}

In [87]:
pd.Series(data_1)

State    [Mumbai, Pune, Chennai, Delhi, Nagpur]
year             [2001, 2011, 2018, 2019, 2020]
pop                   [1.5, 1.7, 3.6, 2.4, 3.2]
dtype: object

In [89]:
df = pd.DataFrame(data_1)

In [91]:
df

     State  year  pop
0   Mumbai  2001  1.5
1     Pune  2011  1.7
2  Chennai  2018  3.6
3    Delhi  2019  2.4
4   Nagpur  2020  3.2

In [94]:
df.style.set_table_styles(
[{'selector':'tr:hover',
  'props':[('background-color','yellow')]
 }]
)

In [95]:
df.head()

     State  year  pop
0   Mumbai  2001  1.5
1     Pune  2011  1.7
2  Chennai  2018  3.6
3    Delhi  2019  2.4
4   Nagpur  2020  3.2

In [96]:
df.head(3)

     State  year  pop
0   Mumbai  2001  1.5
1     Pune  2011  1.7
2  Chennai  2018  3.6

In [97]:
df.tail(2)

    State  year  pop
3   Delhi  2019  2.4
4  Nagpur  2020  3.2

In [98]:
df

     State  year  pop
0   Mumbai  2001  1.5
1     Pune  2011  1.7
2  Chennai  2018  3.6
3    Delhi  2019  2.4
4   Nagpur  2020  3.2

In [99]:
data_1

{'State': ['Mumbai', 'Pune', 'Chennai', 'Delhi', 'Nagpur'],
 'year': [2001, 2011, 2018, 2019, 2020],
 'pop': [1.5, 1.7, 3.6, 2.4, 3.2]}

In [100]:
df2 = pd.DataFrame(data_1,columns=['State','year','pop','debt'],
                  index=['one','two','three','four','five'])

In [101]:
df2

         State  year  pop debt
one     Mumbai  2001  1.5  NaN
two       Pune  2011  1.7  NaN
three  Chennai  2018  3.6  NaN
four     Delhi  2019  2.4  NaN
five    Nagpur  2020  3.2  NaN

In [103]:
df2.columns

Index(['State', 'year', 'pop', 'debt'], dtype='object')

In [104]:
df2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [105]:
df2.columns = ['STATE','YEAR','POP','DEBT']

In [106]:
df2

         STATE  YEAR  POP DEBT
one     Mumbai  2001  1.5  NaN
two       Pune  2011  1.7  NaN
three  Chennai  2018  3.6  NaN
four     Delhi  2019  2.4  NaN
five    Nagpur  2020  3.2  NaN

In [107]:
df2['STATE']  #fetching the data column wise

one       Mumbai
two         Pune
three    Chennai
four       Delhi
five      Nagpur
Name: STATE, dtype: object

In [108]:
type(df2['STATE'])

pandas.core.series.Series

In [109]:
df2[['STATE','POP']]   #fetching multiple columns

         STATE  POP
one     Mumbai  1.5
two       Pune  1.7
three  Chennai  3.6
four     Delhi  2.4
five    Nagpur  3.2

In [110]:
df2['DEBT']

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
Name: DEBT, dtype: object

In [111]:
df2['DEBT'] = 16

In [112]:
df2

         STATE  YEAR  POP  DEBT
one     Mumbai  2001  1.5    16
two       Pune  2011  1.7    16
three  Chennai  2018  3.6    16
four     Delhi  2019  2.4    16
five    Nagpur  2020  3.2    16

In [113]:
df2['DEBT'] = np.arange(1,6)

In [114]:
df2['DEBT']

one      1
two      2
three    3
four     4
five     5
Name: DEBT, dtype: int32

In [115]:
df2

         STATE  YEAR  POP  DEBT
one     Mumbai  2001  1.5     1
two       Pune  2011  1.7     2
three  Chennai  2018  3.6     3
four     Delhi  2019  2.4     4
five    Nagpur  2020  3.2     5

In [116]:
df2

         STATE  YEAR  POP  DEBT
one     Mumbai  2001  1.5     1
two       Pune  2011  1.7     2
three  Chennai  2018  3.6     3
four     Delhi  2019  2.4     4
five    Nagpur  2020  3.2     5

In [121]:
df2.loc['three']

STATE    Chennai
YEAR        2018
POP          3.6
DEBT           3
Name: three, dtype: object

In [118]:
type(df2.loc['three'])

pandas.core.series.Series

In [119]:
df2.loc[['one','five']]  #fetching multiple rows

       STATE  YEAR  POP  DEBT
one   Mumbai  2001  1.5     1
five  Nagpur  2020  3.2     5

In [122]:
df2.iloc[0]  #fetching row wise data on basis of default index value

STATE    Mumbai
YEAR       2001
POP         1.5
DEBT          1
Name: one, dtype: object

In [123]:
df2.iloc[[0,2]]

         STATE  YEAR  POP  DEBT
one     Mumbai  2001  1.5     1
three  Chennai  2018  3.6     3